Revit 2024 API
StructuralSettings.BoundaryConditionFamilySymbolUserDefined Property
 The id of the FamilySymbol to represent a user-defined boundary condition.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public ElementId BoundaryConditionFamilySymbolUserDefined { get; set; }
Visual Basic
Public Property BoundaryConditionFamilySymbolUserDefined As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ BoundaryConditionFamilySymbolUserDefined {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace